In [1]:
%%capture
%load_ext sql
%sql sqlite:///factbook.db

'Connected: None@factbook.db'

In [3]:
%%sql
SELECT *
FROM sqlite_master
WHERE type='table';

Done.

[('table', 'sqlite_sequence', 'sqlite_sequence', 3, 'CREATE TABLE sqlite_sequence(name,seq)'),
 ('table', 'facts', 'facts', 47, 'CREATE TABLE "facts" ("id" INTEGER PRIMARY KEY AUTOINCREMENT NOT NULL, "code" varchar(255) NOT NULL, "name" varchar(255) NOT NULL, "area" integer, "a ... (4 characters truncated) ... land" integer, "area_water" integer, "population" integer, "population_growth" float, "birth_rate" float, "death_rate" float, "migration_rate" float)')]

In [4]:
%%sql 
SELECT *
FROM facts
LIMIT 5;

Done.

[(1, 'af', 'Afghanistan', 652230, 652230, 0, 32564342, 2.32, 38.57, 13.89, 1.51),
 (2, 'al', 'Albania', 28748, 27398, 1350, 3029278, 0.3, 12.92, 6.58, 3.3),
 (3, 'ag', 'Algeria', 2381741, 2381741, 0, 39542166, 1.84, 23.67, 4.31, 0.92),
 (4, 'an', 'Andorra', 468, 468, 0, 85580, 0.12, 8.13, 6.96, 0.0),
 (5, 'ao', 'Angola', 1246700, 1246700, 0, 19625353, 2.78, 38.78, 11.49, 0.46)]

In [5]:
%%sql
SELECT MIN(population), MAX(population), MIN(population_growth), MAX(population_growth)
FROM facts;

Done.

[(0, 7256490011, 0.0, 4.02)]

In [6]:
%%sql 
SELECT name
FROM facts
ORDER BY population
LIMIT 1;

Done.

[('Ashmore and Cartier Islands',)]

In [13]:
%%sql 
SELECT *
FROM facts
WHERE population=0;

Done.

[(250, 'ay', 'Antarctica', None, 280000, None, 0, None, None, None, None)]

In [8]:
%%sql 
SELECT *
FROM facts
ORDER BY population DESC
LIMIT 1;

Done.

[(261, 'xx', 'World', None, None, None, 7256490011, 1.08, 18.6, 7.8, None)]

In [15]:
%%sql 
SELECT MIN(population), MAX(population), MIN(population_growth), MAX(population_growth)
FROM facts
WHERE (name!='World');

Done.

[(0, 1367485388, 0.0, 4.02)]

In [16]:
%%sql 
SELECT AVG(population), AVG(area)
FROM facts
WHERE (name!='World');

Done.

[(32242666.56846473, 555093.546184739)]

In [17]:
%%sql
SELECT *
FROM facts
WHERE (population > (SELECT AVG(population) FROM facts))
AND (area < (SELECT AVG(area) FROM facts));

Done.

[(14, 'bg', 'Bangladesh', 148460, 130170, 18290, 168957745, 1.6, 21.14, 5.61, 0.46),
 (65, 'gm', 'Germany', 357022, 348672, 8350, 80854408, 0.17, 8.47, 11.42, 1.24),
 (85, 'ja', 'Japan', 377915, 364485, 13430, 126919659, 0.16, 7.93, 9.51, 0.0),
 (138, 'rp', 'Philippines', 300000, 298170, 1830, 100998376, 1.61, 24.27, 6.11, 2.09),
 (173, 'th', 'Thailand', 513120, 510890, 2230, 67976405, 0.34, 11.19, 7.8, 0.0),
 (185, 'uk', 'United Kingdom', 243610, 241930, 1680, 64088222, 0.54, 12.17, 9.35, 2.54),
 (192, 'vm', 'Vietnam', 331210, 310070, 21140, 94348835, 0.97, 15.96, 5.93, 0.3)]

In [19]:
%%sql
SELECT name
FROM facts
WHERE name!='World'
ORDER BY population DESC
LIMIT 1;

Done.

[('China',)]

In [20]:
%%sql
SELECT name
FROM facts
WHERE name!='World'
ORDER BY population_growth DESC
LIMIT 1;

Done.

[('South Sudan',)]

In [26]:
%%sql
SELECT *
FROM facts
WHERE (name!='World')
AND (area_water > area_land);

Done.

[(228, 'io', 'British Indian Ocean Territory', 54400, 60, 54340, None, None, None, None, None),
 (247, 'vq', 'Virgin Islands', 1910, 346, 1564, 103574, 0.59, 10.31, 8.54, 7.67)]

In [34]:
%%sql 
SELECT name, CAST(area_water AS Float) / area_land AS water_land_ratio 
FROM facts
WHERE name!='World'
ORDER BY water_land_ratio DESC
LIMIT 5;

Done.

[('British Indian Ocean Territory', 905.6666666666666),
 ('Virgin Islands', 4.520231213872832),
 ('Puerto Rico', 0.5547914317925592),
 ('Bahamas, The', 0.3866133866133866),
 ('Guinea-Bissau', 0.2846728307254623)]

In [33]:
%%sql 
SELECT name, population_growth
FROM facts
ORDER BY population_growth DESC
LIMIT 5;

Done.

[('South Sudan', 4.02),
 ('Malawi', 3.32),
 ('Burundi', 3.28),
 ('Niger', 3.25),
 ('Uganda', 3.24)]

In [35]:
%%sql 
SELECT name
FROM facts
WHERE death_rate > birth_rate;

Done.

[('Austria',),
 ('Belarus',),
 ('Bosnia and Herzegovina',),
 ('Bulgaria',),
 ('Croatia',),
 ('Czech Republic',),
 ('Estonia',),
 ('Germany',),
 ('Greece',),
 ('Hungary',),
 ('Italy',),
 ('Japan',),
 ('Latvia',),
 ('Lithuania',),
 ('Moldova',),
 ('Monaco',),
 ('Poland',),
 ('Portugal',),
 ('Romania',),
 ('Russia',),
 ('Serbia',),
 ('Slovenia',),
 ('Ukraine',),
 ('Saint Pierre and Miquelon',)]

In [37]:
%%sql
SELECT name, (CAST(population as Float) / area
FROM facts
ORDER BY population / area
LIMIT 5;

Done.

[('Chad',),
 ('Niger',),
 ('Holy See (Vatican City)',),
 ('Ashmore and Cartier Islands',),
 ('Coral Sea Islands',)]